# WallTypeUnsupportedError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..JoinElementsFailures..::..WallTypeUnsupportedError Property
BuiltInFailures..::..JoinElementsFailures Class See Also
---
The selected wall type/shape isn't supported for attaching a wall to a stair. To continue, detach the wall from the stairs' components.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId WallTypeUnsupportedError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WallTypeUnsupportedError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ WallTypeUnsupportedError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..JoinElementsFailures Class
Autodesk.Revit.DB Namespace